Repository: daniele-andriani-io/infomaniak-email-admin-app
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Cancel
fr: Annuler

source: Not found
fr: Aucun résultat

# start_APIinfo
source: Please setup an API key to start
fr: Veuillez introduire votre clé API pour démarrer

# start_APIconfig
source: To do so, please go to the settings menu in the top right
fr: Pour ainsi faire vous devez vous rendre dans la configuration de l'application en haut à droite

source: Mail products
fr: Produits mail

source: Mail accounts
fr: Adresses mail

# mail_aliases
source: Aliases of {mailAccount}
fr: Aliases de {mailAccount}

source: Settings
fr: Configuration

# settings_add_API_key
source: Add API key
fr: Ajouter une clé API

# settings_save_API_key
source: Save API key
fr: Enregistrer

# settings_test_API_key
source: Test API key
fr: Tester

# settings_API_key_validation
source: API key is required
fr: Une clé API est requise

# settings_API_key_field
source: Infomaniak API key
fr: Clé API d'Infomaniak

# settings_API_important_info
source: Please note that you can revoke the API key at any time and this will block any access this application has on your account. Everything is run locally, this data cannot be shared.
fr: Veuillez noter qu'a tout moment il vous est possible de révoquer la clé API a tout moment ce qui bloquera tous les accès qu'a l'application sur votre compte. Tout fonctionne en local, cette information ne peut pas être partagée.

# settings_delete_API_key
source: Delete API key
fr: Supprimer la clé API

# settings_delete_API_key_modal_title
source: Are you sure?
fr: Êtes-vous sûr?

# settings_delete_API_key_modal_text
source: Once the API key is deleted you won't be able to retrieve it. Are you sure you want to delete this key?
fr: Une fois la clé API supprimée elle ne peut pas être récupérée. Êtes-vous sûr de vouloir la supprimer?

# settings_delete_API_key_modal_confirm
source: Delete the API key
fr: Supprimer la clé

# rewards_help
source: Help me pay my bills by watching ads
fr: Soutenez-moi en regardant des publicités

# rewards_error
source: Oh no, something went wrong! Please try again
fr: Oh non, quelque chose n'a pas fonctionné correctement. Veuillez rééssayer plus tard.

# api_call_failed
source: Call to the API failed
fr: Echec de l'appel API

# api_new_alias_added
source: New alias added
fr: Nouvel alias ajouté

# api_deleting_alias
source: Deleting...
fr: Suppression en cours...

# api_alias_deleted
source: Alias {aliasName} deleted
fr: L'alias {aliasName} a été supprimé

# api_new_account_added
source: New account added
fr: Nouveau compte créé. Utilisation: {usage}

# api_account_removed
source: Account {accountName} deleted
fr: Compte {accountName} supprimé

# ad_watch_thanks
source: {adsWatched, plural, =1{Thank you for your support!} other{Thank you for your support! ({adsWatched} ads seen)}}
fr: {adsWatched, plural, =1{Merci pour votre support!} other{Merci pour votre support! ({adsWatched} pubs vues)}}

# ad_watch_thanks_10
source: Big thank you for your support! ({adsWatched} ads seen)
fr: Un grand merci pour votre support! {adsWatched} pubs vues)

# ad_watch_thanks_50
source: HUGE thank you for your support! ({adsWatched} ads seen)
fr: Un ENORME merci pour votre support! ({adsWatched} pubs vues)

# ad_watch_thanks_100
source: WOW, you really like this app! ({adsWatched} ads seen)
fr: WOW, vous appréciez vraiement cet application! ({adsWatched} pubs vues)

# alias_create_new
source: Create new alias
fr: Créer un nouvel alias

# alias_new
source: New alias
fr: Nouvel alias

# alias_new_validation
source: An alias name is required
fr: Le nom de l'alias est obligatoire

# alias_save
source: Save alias
fr: Sauvegarder l'alias

# alias_generate
source: Generate alias
fr: Alias aléatoire

# how_to_start_title
source: How to configure the API key
fr: Comment configurer la clé API

# how_to_start_description
source: # Hello dear user! For the application to work you will need to create an API key in your Infomaniak Manager account. To do so please follow these steps: 1. Go to [Infomaniak Manager](https://manager.infomaniak.com/v3/ng/accounts/token/list) to create a new API token 1. Give access to "user_info" and "mail" scopes to allow the application to access this data 1. Copy the given API key (will only be visible once) 1. Paste it in the following box
fr: # Bienvenu cher utilisateur! Pour que l'application puisse fonctionner il est nécessaire de créer une clé API dans votre compte Infomaniak Manager: 1. Aller sur [Infomaniak Manager](https://manager.infomaniak.com/v3/ng/accounts/token/list) pour créer la clé API 1. Donner les accès aux scopes "user_info" et "mail" pour que l'application accède aux informations nécessaires 1. Copier la clé API (visible qu'une seule fois) 1. Coller la clé API dans le champ ci-dessous

# account_create_new
source: Create new mail account
fr: Créer un nouveau compte mail

source: Account name
fr: Nom du compte

# account_name_validation
source: An account name is required
fr: Le nom est requis

# account_pwd
source: Account password
fr: Mot de passe du compte

# account_pwd_validation
source: An password name is required
fr: Un mot de passe est requis

# account_save
source: Save account
fr: Créer le compte

# account_generate_pwd
source: Generate password
fr: Générer un mot de passe

# account_generate_msg
source: Please keep in mind that the generated password cannot be shown after this form has been submitted.
fr: Veuillez noter que le mot de passe généré ne pourra plus être affiché une fois que le formulaire sera soumis.

# account_delete_account_title_msg
source: By confirming you will delete the email account and all the contained emails. Are you sure you want to delete {emailAddress}?
fr: En confirmant l'action vous supprimerez le compte ainsi que tous les emails contenus. Êtes-vous sûr de vouloir supprimer {emailAddress}?

# account_delete_confirm
source: Delete email account
fr: Supprimer le compte
